[{"id":1629900000,"title":"StimPact\r","author":"Christian Ilagan\r","date":"August 26, 2021\r","content":"\r\n## Neural Stimulator (C/Python)\r\n\r\n*Project*\r\n\r\n\r\n#### What is StimPact?\r\nStimPact is a wirelessly controlled Neural Stimulator that is to be used on animals as small as Rats. The purpose of this stimulator is to send electrical pulses to the neurons in the animal, and recording/analysing the responses of stimulation. This project has been worked on by an interdisciplinary team of students consisting of electrical and mechatronics engineers as well as computer science students.\r\n\r\n\r\n<br />\r\n\r\n#### Responsibilities:\r\nBeing part of the Software team, I am responsible for creating and developing both the firmware and software side. The firmware side is the brains of the stimulator itself. Communicating with the software to execute any commands sent from the software via BLE. The firmware has multiple channels which allows it to send data back to the user interface on the Software.\r\n<br />\r\n\r\n\r\n\r\n*StimPact prototype*\r\n\r\n\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/stimpact.jpg\"\r\n     alt=\"\"\r\n     width=\"100%\"\r\n     height=\"25%\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n#### Reflection:\r\nThis is the first project in which I have been exposed to solving real world problems using my skills as a computer science student. Being part of this project has pushed me to learn more about my field and beyond, inspiring me to become a better software developer. This project has had many steep learning curves, some of which I have yet to overcome. Regardless of this, participation in this project has allowed me to learn so much, both as a developer and a member of a team\r\n\r\n\r\n#### Next steps:\r\nFrom this experience, I hope to program more with Python, developing applications targeted towards real world problems.\r\n"},{"id":1629813600,"title":"Modular FlatPack\r","author":"Christian Ilagan\r","date":"August 25, 2021\r","content":"\r\n## Modular FlatPack (MDP)\r\n\r\n*Project*\r\n\r\n\r\n#### What is my Modular Flatpack?\r\nThe Modular Flatpack is a furniture product that transforms from one type of furniture to another. An example in my design being from bed frame to a modular storage system/cupboard to little modules to store shoes or clothes. The idea of flatpacking came to mind when designing due to its ability to be compact and easily transportable, further reducing the amoount of pollution when delivering the product.\r\n\r\n\r\n<br />\r\n\r\n#### Process:\r\nThis project was made by following the practices and principles of design and development. At the start of the project, I first brainstormed potential problems in the world that could be solved. Looking into a range of fields from software to health. But the one that really caught my eye was that of the furniture industry and how much waste is produced per year from just Furniture alone. As such I decided to take action on the problem. Initially I had started by sketching ideas on furniture that could be re-used or recycled, Then on these sketches I began prototyping using CAD and 3D printers to develop small scaled models. Building upon faults in previous iterations of design, I eventually developed a product that was both compact, reusable, recycleable, affordable and easy to construct.\r\n<br />\r\n\r\n\r\n\r\n*Initial Sketch Ideas*\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/flatpack.PNG\"\r\n     alt=\"\"\r\n     width=\"100%\"\r\n     height=\"25%\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n\r\n<hr />\r\n\r\n\r\n\r\nThis project required alot of planning and consistency throughout the one year timeframe to complete. As such I had created a time line to complete certain aspects of the project.\r\n<br />\r\n\r\n\r\n*Time plan*\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/0f2955858e33362e280da020bbb0b4526d17adbf/src/images/timeplan.PNG\"\r\n     alt=\"\"\r\n     width=\"100%\"\r\n     height=\"25%\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n#### Reflection:\r\nCompletion of this project has allowed me to appreciate how much effort and consideration goes into designing a product that targets both a problem and is usable by people. Reflecting on the whole process of developing this product has made me proud, comparing the initial sketches to the final design product really shows how much progress can be made in terms of skill in just a year.\r\n\r\n\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n\r\n#### Next steps:\r\nFollowing a similar design process, I want to create a software product, something that solves a problem and can be easily used by people.\r\n"},{"id":1629727200,"title":"Flockr\r","author":"Christian Ilagan\r","date":"August 24, 2021\r","content":"\r\n## Flockr (Python/Flask)\r\n\r\n*Project*\r\n\r\n\r\n#### What is Flockr?\r\nFlockr is a communication platform similar to slack or discord. It provides users with the capability of managing your account with profile pictures, passwords, displayed names and more. Similar to what you would expect on any communication platform. It contains features such as group channels, private channels and public channels, providing flexibility and privacy for the users of Flockr.\r\n\r\n\r\n<br />\r\n\r\n#### Process:\r\nThe main purpose of this project was to develop a functioning backend with very little modification to the frontend. Initially the project started off by creating a large collection of blackbox tests. These tests were extremely thorough, covering all the edge cases possible. The initial tests made were covering the most basic features of the application, which included registering a user in the backend. Sending and storing messages in the backend as well as adding users to different channels. From these tests, the implementation of code was then made. This process was followed throughout the whole project, from the most simple functionality, to the more complex and tedious features.\r\n<br />\r\n\r\n\r\n\r\n*State Model*\r\n\r\n\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/flockr.png\"\r\n     alt=\"\"\r\n     width=\"100%\"\r\n     height=\"25%\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n\r\nThis project required us to operate in an agile approach, utilising test driven development to quickly but effectively complete the project. We also used Git as a way to contribute to our code base simultaneously branching off the master branch and merging back in. Weekly standups were used as a way to update each group member on any progress or challenges made.\r\n\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n#### Reflection:\r\nThrough completion of this project I have experienced working an an agile development cycle, Following TDD, I now understand how majority of projects are made and progress. Reflecting on this project I believe one of the most valuable things that I learnt was practicing Git.\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n\r\n#### Next steps:\r\nLearning from this experience, I want to work more with backend content and API's, Potentially looking into developing a platform to showcase an NBA API.\r\n"},{"id":1629640800,"title":"LoopMania\r","author":"Christian Ilagan\r","date":"August 23, 2021\r","content":"\r\n## LoopMania (Java/JFX)\r\n\r\n*Project*\r\n\r\n\r\n#### What is LoopMania?\r\nLoopMania is a videogame developed using Object Oriented Priciples/Design in Java. This videogame starts by the character starting at the beginning of a loop, fighting enemies and gearing up to survive until they win. This videogame includes complex win conditions utilising design patterns such as Decarator, Composite, Observer, State and Strategy. LoopMania was an 8 week project where I got to learn so much about object oriented programming.\r\n\r\n\r\n<br />\r\n\r\n#### Process:\r\nFrom the beginning of the project, It was important to first design a UML diagram showcasing the relationships between the different classes, This was constructed by refering deeply to documentation and requirements created based off of what was wanted/needed in the game. I had also constructed/planned out a Low Fidelity Front end design in which we would construct our front end interface off of. \r\n<br />\r\n\r\n\r\n\r\n*Low fidelity design*\r\n\r\n\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/loopmania.PNG\"\r\n     alt=\"\"\r\n     width=\"100%\"\r\n     height=\"25%\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n\r\nIt was important to be extremely organised such that the project could be finished within the 8 week timeframe which was allocated, as such we operated in an agile approach, utilising test driven development to quickly but effectively complete the project. The use of Git practices vastly increased the productivity of our group as we had branched out and communicated effectively to make sure that no errors were made.\r\n\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n#### Reflection:\r\nThis project has opened my eyes to the possibilities of programming, Through utilisation of design patterns and object oriented principles, I understand how code can be managed and extended upon in development.\r\n\r\n\r\n*Game interface*\r\n\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/4320b2d94336fb36dfadc4608d82be2898d28ffd/src/images/loopmaniagame.PNG\"\r\n     alt=\"\"\r\n     width=\"300\"\r\n     height=\"500\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n<br />\r\n\r\n\r\n\r\n#### Next steps:\r\nLearning from this experience, I want to create a game of my own, defining my own specifications and rules of my own. \r\n"},{"id":1629554400,"title":"Personal Website\r","author":"Christian Ilagan\r","date":"August 22, 2021\r","content":"\r\n## About this website\r\n\r\n*Project*\r\n\r\n\r\n#### Significance:\r\nThis website was created as a platform to showcase who I am as a developer. Highlighting my favourite projects, courses\r\nand experiences as both a student and aspiring software engineer. Countless of hours has gone into making this website, with a basic understanding of HTML/CSS/JavaScript I had faced many challenges on the way. This website is my first completed project with JavaScript/REACT, where previously I had faced too many hurdles and decided to restart multiple times. As such I feel as though it will always be a project I am proud of.\r\n\r\n\r\n<br />\r\n\r\n#### Process:\r\nSelf-teaching myself HTML/CSS/JavaScript has been both rewarding and challenging. Starting from essentially ground 0, I had many initial doubts as to what I could potentially create in this website. Nevertheless through planning and trial and error, I had reached a design in which I was satisfied with. Incorporating some of my favourite colours of blue and orange as the theme of the website. As well as giving it a neon glow to add more depth and give more life to the website.\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n*Image of initial design*\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/personalweb.PNG\"\r\n     alt=\"\"\r\n     width=\"100%\"\r\n     height=\"25%\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n<br />\r\n\r\n\r\n#### Next steps:\r\nLearning from making this website has made me want to explore more of front end development, I hope to venture more into product design and more practical uses. Regardless you will see all my future projects here :D\r\n"},{"id":1629468000,"title":"My First Post\r","author":"Christian Ilagan\r","date":"August 21, 2021\r","content":"\r\n## Welcome to my blog!!!\r\n\r\n*First of many blog posts*\r\n\r\nHello World!\r\nThis is the very first blog post I have made for my personal website. This blog was made using ReactMarkdown to dynamically load markdown files into pages. In this blog I will showcase any updates made to this website as well as any exciting projects I have been working on.\r\n<hr />\r\n\r\nHeres a picture of a dog :D\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/ed73bebb80d213cf7d88649926c838857f726c8b/src/images/dog.png\"\r\n     alt=\"\"\r\n     width=\"300\"\r\n     height=\"300\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n"}]