[{"id":1629640800,"title":"LoopMania\r","author":"Christian Ilagan\r","date":"August 23, 2021\r","content":"\r\n## LoopMania (Java/JFX)\r\n\r\n*Project*\r\n\r\n\r\n#### What is LoopMania?\r\nLoopMania is a videogame developed using Object Oriented Priciples/Design in Java. This videogame starts by the character starting at the beginning of a loop, fighting enemies and gearing up to survive until they win. This videogame includes complex win conditions utilising design patterns such as Decarator, Composite, Observer, State and Strategy. LoopMania was an 8 week project where I got to learn so much about object oriented programming.\r\n\r\n\r\n<br />\r\n\r\n#### Process:\r\nFrom the beginning of the project, It was important to first design a UML diagram showcasing the relationships between the different classes, This was constructed by refering deeply to documentation and requirements created based off of what was wanted/needed in the game. I had also constructed/planned out a Low Fidelity Front end design in which we would construct our front end interface off of. \r\n<br />\r\n\r\n\r\n\r\n*Low fidelity design*\r\n\r\n\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/loopmania.PNG\"\r\n     alt=\"\"\r\n     width=\"600\"\r\n     height=\"300\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n<br />\r\n\r\n\r\n\r\nIt was important to be extremely organised such that the project could be finished within the 8 week timeframe which was allocated, as such we operated in an agile approach, utilising test driven development to quickly but effectively complete the project. The use of Git practices vastly increased the productivity of our group as we had branched out and communicated effectively to make sure that no errors were made.\r\n<br />\r\n\r\n<hr />\r\n\r\n\r\n#### Reflection:\r\nThis project has opened my eyes to the possibilities of programming, Through utilisation of design patterns and object oriented principles, I understand how code can be managed and extended upon in development.\r\n\r\n\r\n*Game interface*\r\n\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/personalweb.PNG\"\r\n     alt=\"\"\r\n     width=\"500\"\r\n     height=\"300\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n<br />\r\n\r\n\r\n\r\n#### Next steps:\r\nLearning from this experience, I want to create a game of my own, defining my own specifications and rules of my own. \r\n"},{"id":1629554400,"title":"Personal Website\r","author":"Christian Ilagan\r","date":"August 22, 2021\r","content":"\r\n## About this website\r\n\r\n*Project*\r\n\r\n\r\n#### Significance:\r\nThis website was created as a platform to showcase who I am as a developer. Highlighting my favourite projects, courses\r\nand experiences as both a student and aspiring software engineer. Countless of hours has gone into making this website, with a basic understanding of HTML/CSS/JavaScript I had faced many challenges on the way. This website is my first completed project with JavaScript/REACT, where previously I had faced to many hurdles and decided to restart multiple times. As such I feel as though it will always be a project I am proud of.\r\n\r\n\r\n<br />\r\n\r\n#### Process:\r\nSelf-teaching myself HTML/CSS/JavaScript has been both rewarding and challenging. Starting from essentially ground 0, I had many initial doubts as to what I could potentially create in this website. Nevertheless through planning and trial and error, I had reached a design in which I was satisfied with. Incorporating some of my favourite colours of blue and orange as the theme of the website. As well as giving it a neon glow to add more depth and give more life to the website.\r\n\r\n\r\n<br />\r\n\r\n<hr />\r\n\r\n*Image of initial design*\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/80ec2ea4bd01e4297382471a2bb18c2bcd966bbf/src/images/personalweb.PNG\"\r\n     alt=\"\"\r\n     width=\"500\"\r\n     height=\"300\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n\r\n<br />\r\n\r\n\r\n#### Next steps:\r\nLearning from making this website has made me want to explore more of front end development, I hope to venture more into product design and more practical uses. Regardless you will see all my future projects here :D\r\n"},{"id":1629468000,"title":"My First Post\r","author":"Christian Ilagan\r","date":"August 21, 2021\r","content":"\r\n## Welcome to my blog!!!\r\n\r\n*First of many blog posts*\r\n\r\nHello World!\r\nThis is the very first blog post I have made for my personal website. This blog was made using ReactMarkdown to dynamically load markdown files into pages. In this blog I will showcase any updates made to this website as well as any exciting projects I have been working on.\r\n<hr />\r\n\r\nHeres a picture of a dog :D\r\n\r\n<img src=\"https://raw.githubusercontent.com/cmilagan/web/ed73bebb80d213cf7d88649926c838857f726c8b/src/images/dog.png\"\r\n     alt=\"\"\r\n     width=\"300\"\r\n     height=\"300\"\r\n     style=\"float: left; margin-right: 10px;\" />\r\n"}]